CSI API ETABS v1
cPointElm.GetConstraint Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetConstraint(
	string Name,
	ref int NumberItems,
	ref string[] PointName,
	ref string[] ConstraintName,
	eItemTypeElm ItemTypeElm = eItemTypeElm.Element
)
Function GetConstraint (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef PointName As String(),
	ByRef ConstraintName As String(),
	Optional ItemTypeElm As eItemTypeElm = eItemTypeElm.Element
) As Integer
Dim instance As cPointElm
Dim Name As String
Dim NumberItems As Integer
Dim PointName As String()
Dim ConstraintName As String()
Dim ItemTypeElm As eItemTypeElm
Dim returnValue As Integer
returnValue = instance.GetConstraint(Name,
	NumberItems, PointName, ConstraintName,
	ItemTypeElm)
int GetConstraint(
	String^ Name,
	int% NumberItems,
	array<String^>^% PointName,
	array<String^>^% ConstraintName,
	eItemTypeElm ItemTypeElm = eItemTypeElm::Element
)
abstract GetConstraint :
        Name : string *
        NumberItems : int byref *
        PointName : string[] byref *
        ConstraintName : string[] byref *
        ?ItemTypeElm : eItemTypeElm
(* Defaults:
        let _ItemTypeElm = defaultArg ItemTypeElm eItemTypeElm.Element
*)
-> int
Parameters
Name
Type: System.String
NumberItems
Type: System.Int32
PointName
Type: System.String[]
ConstraintName
Type: System.String[]
ItemTypeElm (Optional)
Type: ETABSv1.eItemTypeElm
Return Value
Type: Int32
See Also
Reference
cPointElm Interface
ETABSv1 Namespace